assignment-12.tex
% Created 2015-04-04 Sat 00:37
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage[utf8]{inputenc}
\usepackage[usenames,dvipsnames]{color}
\usepackage[backend=bibtex, style=numeric]{biblatex}
\usepackage{commath}
\usepackage{tikz}
\usetikzlibrary{shapes,backgrounds}
\usepackage{marginnote}
\usepackage{listings}
\usepackage{color}
\usepackage{enumerate}
\hypersetup{urlcolor=blue}
\hypersetup{colorlinks,urlcolor=blue}
\addbibresource{bibliography.bib}
\setlength{\parskip}{16pt plus 2pt minus 2pt}
\definecolor{codebg}{rgb}{0.96,0.99,0.8}
\definecolor{codestr}{rgb}{0.46,0.09,0.2}
\author{Oleg Sivokon}
\date{\textit{<2015-04-03 Fri>}}
\title{Assignment 12, Infinitesimal Calculus}
\hypersetup{
  pdfkeywords={Infinitesimal Calculus, Assignment, Definition of Limits},
  pdfsubject={Second asssignment in the course Infinitesimal Calculus},
  pdfcreator={Emacs 25.0.50.1 (Org mode 8.2.2)}}
\begin{document}

\maketitle
\tableofcontents


\lstset{ %
  backgroundcolor=\color{codebg},
  basicstyle=\ttfamily\scriptsize,
  breakatwhitespace=false,         % sets if automatic breaks should only happen at whitespace
  breaklines=false,
  captionpos=b,                    % sets the caption-position to bottom
  commentstyle=\color{mygreen},    % comment style
  framexleftmargin=10pt,
  xleftmargin=10pt,
  framerule=0pt,
  frame=tb,                        % adds a frame around the code
  keepspaces=true,                 % keeps spaces in text, useful for keeping indentation of code (possibly needs columns=flexible)
  keywordstyle=\color{blue},       % keyword style
  showspaces=false,                % show spaces everywhere adding particular underscores; it overrides 'showstringspaces'
  showstringspaces=false,          % underline spaces within strings only
  showtabs=false,                  % show tabs within strings adding particular underscores
  stringstyle=\color{codestr},     % string literal style
  tabsize=2,                       % sets default tabsize to 2 spaces
}

\clearpage

\section{Problems}
\label{sec-1}

\subsection{Problem 1}
\label{sec-1-1}
\begin{enumerate}
\item Prove from definition $\epsilon-N$:
\begin{equation*}
  \lim_{n \to \infty} \frac{n^2}{n^2-1} = L.
\end{equation*}

\item Prove from definition $M-N$:
\begin{equation*}
   \lim_{n \to \infty} \frac{n^2-n}{n+2} = \infty.
\end{equation*}

\item Formulate $\lim_{n \to \infty} a_n = \infty$ in terms of $M-N$ definition.
\item Prove using the formulation from (3) that:
\begin{equation*}
   \lim_{n \to \infty} (n\sqrt{2} + (-1)^n \lfloor \sqrt{n} \rfloor) = \infty.
\end{equation*}
\end{enumerate}

\subsubsection{Answer 1}
\label{sec-1-1-1}
Recall the definition:

\begin{quote}
Let $(a_n)^{\infty}_{n=1}$ be a sequence, $L$ be a real number.  The
\textbf{sequence $(a_n)$ converges to $L$} if for all $\epsilon > 0$ almost all
elements of the sequence are in the $\epsilon$-neighborhood of $L$.  In such
a case we will say $L$ is the \textbf{limit of sequence $(a_n)$}.
\end{quote}

To be honest, I don't know what this question is asking me to do.  How can
I prove something which is already given in the description of a question?
Anyways, I followed the examples in the book, and here is what I think the
answer might look like.  Sorry, if this is not what you expect.
\begin{equation*}
  \begin{aligned}
    \epsilon &> 1 \implies & \textit{From definition of reals} \\
    \epsilon &> \frac{n^2-1}{n^2-1} \implies & \textit{Provided $n \neq 1$} \\
    \epsilon' &> \frac{1}{n^2-1} \implies & \textit{From Archimedian property} \\
    \epsilon + \epsilon' &> \frac{n^2}{n^2-1} \implies
    & \textit{Provided $\epsilon'' = \epsilon' + \epsilon$} \\
    \epsilon'' &> \abs{\frac{n^2}{n^2-1} - L} & \textit{Provided $0 \leq L \leq 1$}
  \end{aligned}
\end{equation*}

Which completes the ``proof''.
\subsubsection{Answer 2}
\label{sec-1-1-2}
First, recall the definition:

\begin{quote}
We will say that the sequence $(a_n)^{\infty}_{n=1}$ \textbf{tends to infinity}, and
write $\lim_{n \to \infty} a_n = \infty$, if for every real number $M$ there
exists a natural number $N$ such that for all $n > N$ it holds that $a_n > M$.
\end{quote}

We can start by finding a more convenient formulat to work with, for instance:
\begin{equation*}
  \begin{aligned}
    M &= \frac{n^2 - n}{n + 2} \\
    &= \frac{n(n - 1)}{n + 2} \\
    &= \frac{n(n + 2)}{n + 2} - \frac{3n}{n + 2} \\
    &< n - \frac{3n}{n} \\
    &= n - 3.
  \end{aligned}
\end{equation*}

Now, put $N = M + 3$. Thus for every $M$, $a_n$ is greater than $M$ whenver
$n \geq M + 3$.
\subsubsection{Answer 3}
\label{sec-1-1-3}
I'm confused by this question in the same measure I'm confused by the previous
one.  I don't know what do you want me to prove here.  There can be different
reasons for why some sequence doesn't tend to infinity.  It could be because
it is a divergent series, or because it converges to some real limit, or
because it tends to negative infinity.  I can formally negate the statement
but I don't think this negation is useful.
\begin{equation*}
  \begin{aligned}
    \lnot \forall M \in \mathbb{R} : \exists N \in \mathbb{N} :
    \forall n \in \mathbb{N} : (n > N \implies a_n > M) \\
    \textit{Alternatively:} \\
    \exists M \in \mathbb{R} : \forall N \in \mathbb{N} :
    \exists n \in \mathbb{N} : (n > N \implies a_n \leq M)
  \end{aligned}
\end{equation*}
\subsubsection{Answer 4}
\label{sec-1-1-4}
It is easy to see that the given sequence is divergent.  It has two limit
points, where one is at infinity and another one is at zero.  Since I need
to reuse the $M-N$ rule, I will restate this clame in terms of this rule.
There exists a real number $M$, such that for every natural number $N$,
there exists a natural number $n$, such that whenever $n > N$, $a_n \leq M$.
Put $M = 2$, then $a_n = 2(\sqrt{2} + \lfloor \sqrt{2} \rfloor)$.  Now, no matter
the $N$, we can always choose $n$ to be odd, which will give us:
\begin{equation*}
  \begin{aligned}
    2\sqrt{2} + \lfloor 2\sqrt{2} \rfloor \geq n\sqrt{2} - \lfloor n\sqrt{2} \rfloor \\
    \textit{For every $n > 2$} \\
    2 * 2 + \lfloor 2 * 2 \rfloor \geq n 2 - \lfloor n * 2 \rfloor \\
    \textit{By axiom of order} \\
    8 \geq 0.
  \end{aligned}
\end{equation*}
\subsection{Problem 2}
\label{sec-1-2}
Calculate the limits of the expression given above, or prove that the limtes don't
exists:

\begin{eqnarray}
  \lim_{n \to \infty} \sqrt{1 + \frac{a}{n}} \\
  \lim_{n \to \infty} \sqrt{n + a} * \sqrt{n + b} - n \\
  \lim_{n \to \infty} \frac{n^7 - 2n^4 - 1}{n^4 - 3n^6 + 7} \\
  \lim_{n \to \infty} \Big(\frac{n}{n + 1} \sum_{k=1}^n \frac{k}{k+1} \Big)
\end{eqnarray}

\subsubsection{Answer 5}
\label{sec-1-2-1}
Using ``sandwich'' rule we can show that:
\begin{equation*}
  \sqrt{1} < \sqrt{1 + \frac{a}{n}} < 1 + \frac{a}{n}
\end{equation*}

Provided $a$ is non-negative and isn't equal to $n$.  The limit of $\sqrt{1}$
is trivially 1.  The limit of $1 + \frac{a}{n}$ is the sum of the limits of
1 and $\frac{a}{n}$, where the former is the limit of a constant (1), and the
later is zero.  Thus the value is ``sandwiched'' between 1 and 1, hence it
must be 1.
\subsubsection{Answer 6}
\label{sec-1-2-2}
Let's generalize the expression to reuse the previous case:
\begin{equation*}
  \begin{aligned}
    \lim_{n \to \infty} \sqrt{n + a} * \sqrt{n + b} - n &= \\
    \lim_{n \to \infty} \sqrt{n(1 + \frac{a}{n})} * \sqrt{n(1 + \frac{b}{n})} - n &= \\
    \lim_{n \to \infty} n\sqrt{1 + \frac{a}{n}} * \sqrt{1 + \frac{b}{n}} - n &= \\
    \lim_{n \to \infty} n\Big(\sqrt{1 + \frac{a}{n}} * \sqrt{1 + \frac{b}{n}} - 1\Big)
  \end{aligned}
\end{equation*}

Now, recall that $\lim_{n \to \infty} \sqrt{1 + \frac{a}{n}} = 1$, this gives us:
\begin{equation*}
  \begin{aligned}
    \lim_{n \to \infty} n\Big(\sqrt{1 + \frac{a}{n}} * \sqrt{1 + \frac{b}{n}} - 1\Big) &= \\
    \lim_{n \to \infty} n * \lim_{n \to \infty}\sqrt{1 + \frac{a}{n}} *
    \lim_{n \to \infty}\sqrt{1 + \frac{b}{n}} - \lim_{n \to \infty} 1 &= \\
    lim_{n \to \infty} n * (1 * 1 - 1) &= \\
    lim_{n \to \infty} n * 0 &= 0.
  \end{aligned}
\end{equation*}
\subsubsection{Answer 7}
\label{sec-1-2-3}


\subsubsection{Answer 8}
\label{sec-1-2-4}
I will show that the given sequence tentds to infinity.  Some notation first.
I will use $H_n$ to denote the \emph{nth} harmonic numbers.  Let's
at first, simplify the sum:
\begin{equation*}
  \begin{aligned}
    \sum_{k=1}^n \frac{k}{k + 1} &= \\
    \sum_{k=1}^n \frac{k + 1 - 1}{k + 1} &= \\
    \sum_{k=1}^n \frac{k + 1}{k + 1} - \frac{1}{k + 1} &= \\
    \sum_{k=1}^n \frac{k + 1}{k + 1} - \sum_{k=1}^n \frac{1}{k + 1} &= \\
    n - \sum_{k=1}^n \frac{1}{k + 1} &= \\
    n - \sum_{k=2}^{n+1} \frac{1}{k} &= \\
    n - H_{n+1} + 1
  \end{aligned}
\end{equation*}

Now, plug this back into our formula:
\begin{equation*}
  \begin{aligned}
    \lim_{n \to \infty} \frac{n}{n + 1} (n - H_{n+1} + 1) &= \\
    \lim_{n \to \infty} \frac{n}{n + 1} (n - H_{n+1}) + \lim_{n \to \infty}1 &= \\
    \lim_{n \to \infty} \frac{n}{n + 1} (n - H_{n+1}) + 1 &= \\
    \lim_{n \to \infty} \Big( \frac{n^2}{n + 1} - \frac{n}{n + 1} H_{n+1} \Big) + 1 &= \\
    \lim_{n \to \infty} \Big( \frac{n^2 + 1}{n + 1} - \frac{1}{n + 1} -
    \frac{n}{n + 1} H_{n+1} \Big) + 1 &= \\
    \lim_{n \to \infty} \Big( \frac{n(n + 1)}{n + 1} - \frac{1}{n + 1} -
    \frac{n}{n + 1} H_{n+1} \Big) + 1 &= \\
    \lim_{n \to \infty} \Big( n - \frac{1}{n + 1} - \frac{n}{n + 1} H_{n+1} \Big) + 1 &= \\
    \lim_{n \to \infty} n - \lim_{n \to \infty} \frac{1}{n + 1} -
    \lim_{n \to \infty} \frac{n}{n + 1} H_{n+1} + 1 &= \\
    \lim_{n \to \infty} n - 0 - \lim_{n \to \infty} 1 * H_{n+1} + 1 &= \\
    \lim_{n \to \infty} n &= \infty.
  \end{aligned}
\end{equation*}

The last step is allowed becasue for all harmonic numbers greater than one
it holds that $n > H_{n+1}$.
% Emacs 25.0.50.1 (Org mode 8.2.2)
\end{document}